In [1]:
import pandas as pd
import numpy as np

In [4]:
data = np.random.randn(4,3)

In [5]:
dataFrame = pd.DataFrame(data)

In [8]:
dataFrame # excel gibi yazıyor

          0         1         2
0 -0.740671 -0.073330  0.712263
1 -0.161865 -1.403721  0.340195
2 -0.011672  0.087967 -0.079027
3  0.626850  0.252366 -0.171610

In [12]:
dataFrame[0] # sütun olarak getiriyor (cols)

0   -0.740671
1   -0.161865
2   -0.011672
3    0.626850
Name: 0, dtype: float64

In [14]:
yeniDataFrame = pd.DataFrame(data, index=["Atil","Zeynep","Atlas","Mehmet"],columns=["Maas","Yas","Calisma Saati"])

In [15]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.740671 -0.073330       0.712263
Zeynep -0.161865 -1.403721       0.340195
Atlas  -0.011672  0.087967      -0.079027
Mehmet  0.626850  0.252366      -0.171610

In [16]:
yeniDataFrame["Yas"]

Atil     -0.073330
Zeynep   -1.403721
Atlas     0.087967
Mehmet    0.252366
Name: Yas, dtype: float64

In [17]:
yeniDataFrame[["Maas","Yas"]]

            Maas       Yas
Atil   -0.740671 -0.073330
Zeynep -0.161865 -1.403721
Atlas  -0.011672  0.087967
Mehmet  0.626850  0.252366

In [23]:
yeniDataFrame.loc["Atil"] # rowdan çekmek için loc (locate) etmelisin

Maas            -0.740671
Yas             -0.073330
Calisma Saati    0.712263
Name: Atil, dtype: float64

In [24]:
yeniDataFrame.loc[["Atil","Zeynep"]]

            Maas       Yas  Calisma Saati
Atil   -0.740671 -0.073330       0.712263
Zeynep -0.161865 -1.403721       0.340195

In [25]:
yeniDataFrame.iloc[0] # iloc (index location) Atil'in index 0 olduğundan Atili getirdi

Maas            -0.740671
Yas             -0.073330
Calisma Saati    0.712263
Name: Atil, dtype: float64

In [27]:
yeniDataFrame["Emeklilik Yasi"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]
#yeni col ekleme

In [29]:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1) # y = axis = 1, x = axis = 0

            Maas       Yas  Calisma Saati
Atil   -0.740671 -0.073330       0.712263
Zeynep -0.161865 -1.403721       0.340195
Atlas  -0.011672  0.087967      -0.079027
Mehmet  0.626850  0.252366      -0.171610

In [30]:
yeniDataFrame.drop("Emeklilik Yasi", axis = 1, inplace = True)
# inplace true olursa ana DataFrame'de de droplanır.

In [31]:
yeniDataFrame.loc["Atil"]["Calisma Saati"]

0.7122634904864581

In [32]:
yeniDataFrame.loc["Atlas","Yas"]

0.08796685714040683

In [33]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.740671 -0.073330       0.712263
Zeynep -0.161865 -1.403721       0.340195
Atlas  -0.011672  0.087967      -0.079027
Mehmet  0.626850  0.252366      -0.171610

In [35]:
booleanFrame = yeniDataFrame < 0

In [36]:
booleanFrame

         Maas    Yas  Calisma Saati
Atil     True   True          False
Zeynep   True   True          False
Atlas    True  False           True
Mehmet  False  False           True

In [37]:
yeniDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.740671 -0.073330       0.712263
Zeynep -0.161865 -1.403721       0.340195
Atlas  -0.011672  0.087967      -0.079027
Mehmet  0.626850  0.252366      -0.171610

In [69]:
yeniDataFrame[booleanFrame]

             Maas  Yas  Calisma Saati
Yeni Indeks
Ati           NaN  NaN            NaN
Zey           NaN  NaN            NaN
Atl           NaN  NaN            NaN
Meh           NaN  NaN            NaN

In [70]:
yeniDataFrame[yeniDataFrame["Yas"] > 0] # yası 0 dan büyük olanların bilgilerini bastırır

                 Maas       Yas  Calisma Saati
Yeni Indeks
Atl         -0.011672  0.087967      -0.079027
Meh          0.626850  0.252366      -0.171610

In [71]:
yeniIndeksListesi = ["Ati", "Zey", "Atl", "Meh"]

In [72]:
yeniDataFrame["Yeni Indeks"] = yeniIndeksListesi # yeni indeks ekleme

In [73]:
yeniDataFrame

                 Maas       Yas  Calisma Saati Yeni Indeks
Yeni Indeks
Ati         -0.740671 -0.073330       0.712263         Ati
Zey         -0.161865 -1.403721       0.340195         Zey
Atl         -0.011672  0.087967      -0.079027         Atl
Meh          0.626850  0.252366      -0.171610         Meh

In [74]:
yeniDataFrame.set_index("Yeni Indeks", inplace=True)

In [75]:
yeniDataFrame

                 Maas       Yas  Calisma Saati
Yeni Indeks
Ati         -0.740671 -0.073330       0.712263
Zey         -0.161865 -1.403721       0.340195
Atl         -0.011672  0.087967      -0.079027
Meh          0.626850  0.252366      -0.171610

In [83]:
#exeldeki gibi merge etmek
dısIndeksler = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [84]:
icIndeksler = ["Homer", "Bart", "Marge", "Cartman", "Kenny", "Kyle"]

In [88]:
birlesmisIndeks = list(zip(dısIndeksler,icIndeksler))

In [89]:
birlesmisIndeks

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [91]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [92]:
birlesmisIndeks

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [94]:
benimCizgiFilmListem =[[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [95]:
benimCizgiFilmListem

[[40, 'A'], [10, 'B'], [30, 'C'], [9, 'D'], [10, 'E'], [11, 'F']]

In [96]:
cizgiFilmNumpyDizisi = np.array(benimCizgiFilmListem)

In [97]:
cizgiFilmNumpyDizisi

array([['40', 'A'],
       ['10', 'B'],
       ['30', 'C'],
       ['9', 'D'],
       ['10', 'E'],
       ['11', 'F']], dtype='<U11')

In [102]:
cizgiFilmDataFrame = pd.DataFrame(data=cizgiFilmNumpyDizisi,index=birlesmisIndeks,columns=["Yas","Meslek"])

In [103]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [105]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [107]:
cizgiFilmDataFrame.loc["Simpson","Homer"]

Yas       40
Meslek     A
Name: (Simpson, Homer), dtype: object

In [109]:
cizgiFilmDataFrame.loc["Simpson"].loc["Homer"]

Yas       40
Meslek     A
Name: Homer, dtype: object

In [110]:
cizgiFilmDataFrame.index.names = ["Film Adı", "Karakter"]

In [111]:
cizgiFilmDataFrame

                    Yas Meslek
Film Adı   Karakter
Simpson    Homer     40      A
           Bart      10      B
           Marge     30      C
South Park Cartman    9      D
           Kenny     10      E
           Kyle      11      F